Tekla.Structures.Drawing.CurvedDimensionOrthogonal
The CurvedDimensionOrthogonal class defines a curved dimension with orthogonal reference lines.

Tekla.Structures.Drawing.CurvedDimensionOrthogonal.Attributes
Gets or sets the curved dimension set orthogonal attributes.

Tekla.Structures.Drawing.CurvedDimensionOrthogonal.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,System.Double,Tekla.Structures.Drawing.CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes)
Creates a new curved dimension with orthogonal reference lines.
View: The view to be used.
ArcPoint1: The first arc point to be used.
ArcPoint2: The second arc point to be used.
ArcPoint3: The third arc point to be used.
StartPoint: The start point to be used.
EndPoint: The end point to be used.
Distance: The distance in paper millimeters.
Attributes: The attributes to be applied.

Tekla.Structures.Drawing.CurvedDimensionOrthogonal.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,System.Double)
Creates a new curved dimension with orthogonal reference lines
using default attributes.
View: The view to be used.
ArcPoint1: The first arc point to be used.
ArcPoint2: The second arc point to be used.
ArcPoint3: The third arc point to be used.
StartPoint: The start point to be used.
EndPoint: The end point to be used.
Distance: The distance in paper millimeters.

Tekla.Structures.Drawing.CurvedDimensionOrthogonal.GetDimensionSet(System.Boolean)
Gets the dimension set the current dimension belongs to.
Select: Whether to select the object from the database or not.
Returns: The dimension set the current dimension belongs to.

Tekla.Structures.Drawing.CurvedDimensionOrthogonal.QueryOperation(Tekla.Structures.DrawingInternal.QueryTypeEnum)
Communicates with Tekla Structures core.
OperationType: The type of the executed operation.
Returns: True on success.

Tekla.Structures.Drawing.CurvedDimensionOrthogonal.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.